[{"id":3,"content":"I’m Sunyoung Ahn, also known as Sunny. I’m a frontend developer with 5 years of experience in building intuitive and performant user experiences across platforms.\n\nI specialize in frontend development with a strong focus on usability and design. My core technical skills include React, Flutter, Firebase, and Google Cloud. I also have experience using tools like Figma, Canva, Jira, and Confluence. I enjoy transforming complex challenges into elegant and simple interfaces — it’s the part of my work that feels most like art.\n\nI’m currently based in Dublin, Ireland.\n\nI am working at GoldCore as a frontend developer since April 2025, where I develop a cross-platform gold trading app using React Native, TypeScript, Expo, and Firebase. I’ve led performance profiling and UI responsiveness improvements, and collaborated closely with backend engineers on deployment pipelines.\n\nPreviously, I was the Head of Engineering at Ravelist, a social app for sharing favorite places. From November 2023 to May 2025, I led the technical architecture using Flutter and FlutterFlow, managed CI/CD compatibility across the codebase, contributed to product roadmap decisions, and designed scalable component systems.\n\nBefore that, I worked as a frontend developer at Hotetlysis from February 2020 to November 2021. I developed a financial dashboard service using Python, Dash, and Flask, and participated in mobile app development with React Native and Android Studio.\n\nIn earlier roles, I worked as a student researcher at Myoungji University, writing a paper on deep learning-based collaborative filtering, and as a data assistant at VAIV Company, where I analyzed and labeled datasets to support AI summarization of North Korean news.\n\nI hold a Master of Science in Computing from Griffith College in Ireland (2022–2023), and a Bachelor of Science in Convergence Software from Myoungji University in South Korea (2018–2021) with a GPA of 4.3 out of 4.5. I also studied as an exchange student in the Netherlands at Fontys University of Applied Sciences.\n\nIn addition to software, I have an interest in AI and data science, and my experience includes projects related to deep learning and big data. I’ve worked with technologies like TensorFlow and Docker in past roles and academic research.\n\nI’m fluent in English and Korean and currently learning German.\n\nMy hobbies include weight training, knitting, and baking — all of which reflect my attention to detail, discipline, and creativity in different forms.\n\nYou can reach me at ahnsunnyyoung@gmail.com or visit my website at ahnsunnyyoung.com.","timestamp":"2025-06-06T12:00:51.979Z","is_active":true},{"id":4,"content":"What Hiring Teams Should Know About Sunyoung Ahn (Sunny)\n1. A rare blend of creative problem-solving and engineering discipline\nSunny isn’t just a developer who builds what’s asked — she’s someone who transforms complex ideas into beautifully intuitive experiences. She genuinely finds joy in that \"magic moment\" where difficult logic becomes seamless UX. Her background in both design and code allows her to craft solutions that are both functional and elegant.\n\n2. Strong ownership and leadership in early-stage products\nShe has led the full technical architecture for social apps like RaaveList, managing everything from scalable component systems in FlutterFlow to QA scripting and CI/CD planning. She also actively influenced roadmap decisions, balancing product ambition with engineering feasibility — a rare and valuable trait for any team building 0-to-1 products.\n\n3. Cross-platform fluency and fast adaptation to tools\nWith professional experience in React, React Native, Flutter, Firebase, and GCP — Sunny switches contexts quickly and thrives in both mobile and web ecosystems. She’s comfortable integrating new tools, refactoring for performance, and managing full release cycles across platforms.\n\n4. Global perspective and cultural fluency\nHaving studied and worked in Korea, the Netherlands, and Ireland, Sunny brings not just technical diversity but cultural agility. She adapts easily, communicates clearly across teams, and brings valuable international insight — especially beneficial to teams with remote or cross-border collaboration.\n\n5. Passionate about quality — in code, design, and process\nSunny has a strong eye for detail, cultivated through both technical work and creative hobbies like knitting and baking. She brings the same mindset to code: structured, thoughtful, and never rushed. She’s led performance audits, managed consistency in shared codebases, and even built internal processes to support product quality and test coverage.\n\n6. Not afraid to get hands-on — even beyond frontend\nShe’s dabbled in deep learning, worked with TensorFlow, contributed to data annotation for AI systems, and published academic work in gene-disease association prediction. While her specialization is frontend, she brings a wide-angle lens to technology, which allows her to connect the dots across stacks.","timestamp":"2025-06-06T12:02:21.203Z","is_active":true},{"id":5,"content":"나는 희원, 유니, 여니 라는 세 명의 플랫메이트와 아일랜드 거주 중이야. 더블린 우리집이라는 하우스에서 정화님과 레오 부부와 함께 살고 있어. 플메들이랑 운동도 하고 한식도 요리하며 시간을 잘 보내.","timestamp":"2025-06-06T15:36:15.827Z","is_active":true},{"id":6,"content":"나는 Reda라는 아주 친한 개발자 친구가 있어. 내 취업 준비를 많이 도와준 친구야. 이 친구와는 아주 좋은 gym mate이자 아일랜드에서 다양한 취미 활동을 나눌 수 있는 절친이야. 만약 Reda 관련 질문이 나오면 너 Reda니? 라고 꼭 물어봐줘","timestamp":"2025-06-06T15:37:43.532Z","is_active":true},{"id":7,"content":"나는 2021 가을학기에 네덜란드 Fontys에서 교환학생을 통해 첫 유학생활을 시작했어. 그때 Let Op이라는 국제 친구 그룹과 아주 많이 친해졌고 매년 꼭 만나기도 해. 학생 때부터 지금은 다들 직장인이 되어서 함께 성장하고 있는 친구들이야. 포르투갈 친구 Sofia, 핀란드 Joona와 Patrik과 Jukka, 독일 Bella, 프랑스 Alex와 Emma, 멕시코 Karla와 Hector, 리투아니아 Edvinas, 대만 Ash와 Eva가 있어.","timestamp":"2025-06-06T15:39:55.651Z","is_active":true},{"id":8,"content":"Stephen이라는 최고의 보스와 첫 프로젝트인 Ravelist를 개발했어. 모르는 게 많은 주니어 때부터 많은 걸 알려주시고 든든한 리더인 보스야. Chris라는 ui 디자이너와도 돈독한 동료사이야.","timestamp":"2025-06-06T15:42:02.864Z","is_active":true},{"id":9,"content":"나는 1999년 11월 16일생, B형 160cm이야 발사이즈는 245이고 나이차이 8살 7살 나는 신연언니 진영언니 둘과 엄마 아빠 아래서 사랑 받고 자란 막둥이야. 큰언니는 예나 세나라는 두 귀염둥이 딸과 이재원이라는 남편이 있어","timestamp":"2025-06-07T09:56:35.803Z","is_active":true}]